TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_rtdma.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the DST_WRAP_COUNT register
//
//*************************************************************************************************
#define RTDMA_DST_WRAP_COUNT_WRAPSIZE_S   0U
#define RTDMA_DST_WRAP_COUNT_WRAPSIZE_M   0xFFFFU   // These bits indicate the current wrap counter
                                                    // value:

//*************************************************************************************************
//
// The following are defines for the bit fields in the DST_WRAP_STEP register
//
//*************************************************************************************************
#define RTDMA_DST_WRAP_STEP_WRAPSTEP_S   0U
#define RTDMA_DST_WRAP_STEP_WRAPSTEP_M   0xFFFFU   // Destination post-increment/decrement step
                                                   // size for a wrap

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHSECLAT1 register
//
//*************************************************************************************************
#define RTDMA_CHSECLAT1_ZONE_S      0U
#define RTDMA_CHSECLAT1_ZONE_M      0xFU         // Channel owner zone
#define RTDMA_CHSECLAT1_LINK_S      8U
#define RTDMA_CHSECLAT1_LINK_M      0xF00U       // Channel owner Link
#define RTDMA_CHSECLAT1_APILINK_S   16U
#define RTDMA_CHSECLAT1_APILINK_M   0xF0000U     // Channel owner Clink
#define RTDMA_CHSECLAT1_STACK_S     24U
#define RTDMA_CHSECLAT1_STACK_M     0xF000000U   // Channel owner Stack

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHSECLAT2 register
//
//*************************************************************************************************
#define RTDMA_CHSECLAT2_SECURE     0x1U        // Channel SECURE Information
#define RTDMA_CHSECLAT2_PRIV_S     8U
#define RTDMA_CHSECLAT2_PRIV_M     0x300U      // Channel PRIV information
#define RTDMA_CHSECLAT2_PRIVID_S   16U
#define RTDMA_CHSECLAT2_PRIVID_M   0xFF0000U   // Channel PRIVID information

//*************************************************************************************************
//
// The following are defines for the bit fields in the BURST_INTF_CTRL register
//
//*************************************************************************************************
#define RTDMA_BURST_INTF_CTRL_BURSTCTRL_S   0U
#define RTDMA_BURST_INTF_CTRL_BURSTCTRL_M   0x3U   // Control Burst Interface operation

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHCFG_LOCK register
//
//*************************************************************************************************
#define RTDMA_CHCFG_LOCK_LOCK   0x1U   // Temporary Lock

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHCFG_COMMIT register
//
//*************************************************************************************************
#define RTDMA_CHCFG_COMMIT_COMMIT   0x1U   // Permanent Commit


//*************************************************************************************************
//
// The following are defines for the bit fields in the FLTEMU_CONFIG register
//
//*************************************************************************************************
#define RTDMA_FLTEMU_CONFIG_ENABLE           0x1U      // Fault emulation enable
#define RTDMA_FLTEMU_CONFIG_DBL_BIT_INJ_EN   0x2U      // Double bit injection enable
#define RTDMA_FLTEMU_CONFIG_KEY_S            8U
#define RTDMA_FLTEMU_CONFIG_KEY_M            0xFF00U   // Write Key
#define RTDMA_FLTEMU_CONFIG_KEY              0xA500U   // Key Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the FLTEMU_ACCGRPSEL register
//
//*************************************************************************************************
#define RTDMA_FLTEMU_ACCGRPSEL_CTRL_GROUP_SEL_S   0U
#define RTDMA_FLTEMU_ACCGRPSEL_CTRL_GROUP_SEL_M   0xFFU     // CTRL group selection
#define RTDMA_FLTEMU_ACCGRPSEL_DATA_GROUP_SEL_S   8U
#define RTDMA_FLTEMU_ACCGRPSEL_DATA_GROUP_SEL_M   0xFF00U   // DATA READ1 control information bus
                                                            // selection

//*************************************************************************************************
//
// The following are defines for the bit fields in the FLTEMU_BITSEL register
//
//*************************************************************************************************
#define RTDMA_FLTEMU_BITSEL_BITSEL_S   0U
#define RTDMA_FLTEMU_BITSEL_BITSEL_M   0x7FU   // Fault emulation bit selection


//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_DATA2 register
//
//*************************************************************************************************
#define RTDMA_SELFTEST_DIAG_DATA2_SELFTEST_DIAG_DATA2_S   0U
#define RTDMA_SELFTEST_DIAG_DATA2_SELFTEST_DIAG_DATA2_M   0x1FFFFU   // Self test Diagnostics data
                                                                     // 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_ECC register
//
//*************************************************************************************************
#define RTDMA_SELFTEST_DIAG_ECC_SELFTEST_DIAG_ECC_S   0U
#define RTDMA_SELFTEST_DIAG_ECC_SELFTEST_DIAG_ECC_M   0xFFU   // Self test Diagnostics ECC

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_CONTROL register
//
//*************************************************************************************************
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_TEST_EN_S       0U
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_TEST_EN_M       0xFU          // Diagnostic test enable
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_SAFETY_SEL      0x40U         // Diagnostic safety
                                                                       // selection
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_CHECKER_SEL_S   8U
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_CHECKER_SEL_M   0x300U        // ECC checker selection
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_ECC_WIDTH_S     16U
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_ECC_WIDTH_M     0xF0000U      // Diagnostic ECC width
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_DATA_WIDTH_S    24U
#define RTDMA_SELFTEST_DIAG_CONTROL_DIAG_DATA_WIDTH_M    0xFF000000U   // Diagnostic Data width

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_STATUS register
//
//*************************************************************************************************
#define RTDMA_SELFTEST_DIAG_STATUS_DIAG_TEST_DONE           0x2U      // Done self test
#define RTDMA_SELFTEST_DIAG_STATUS_DIAG_TEST_FAIL           0x4U      // Test failed
#define RTDMA_SELFTEST_DIAG_STATUS_DIAG_FAIL_C_ERROR        0x8U      // Diagnostic correctable
                                                                      // error
#define RTDMA_SELFTEST_DIAG_STATUS_DIAG_FAIL_UC_ERROR       0x10U     // Diagnostic uncorrectable
                                                                      // error
#define RTDMA_SELFTEST_DIAG_STATUS_DIAG_FAIL_CHECK_TYPE_S   5U
#define RTDMA_SELFTEST_DIAG_STATUS_DIAG_FAIL_CHECK_TYPE_M   0x60U     // Failed diagnostic check
                                                                      // type
#define RTDMA_SELFTEST_DIAG_STATUS_DIAG_FAIL_BIT_INDEX_S    8U
#define RTDMA_SELFTEST_DIAG_STATUS_DIAG_FAIL_BIT_INDEX_M    0xFF00U   // Error bit position

//*************************************************************************************************
//
// The following are defines for the bit fields in the SELFTEST_DIAG_STATUS_CLR register
//
//*************************************************************************************************
#define RTDMA_SELFTEST_DIAG_STATUS_CLR_DIAG_TEST_DONE   0x2U   // Clear self test done status flag
#define RTDMA_SELFTEST_DIAG_STATUS_CLR_DIAG_TEST_FAIL   0x4U   // Clear test failed status flags



#endif
